// Напиши функцію, яка приймає рядок і повертає найчастіший символ у ньому. Якщо таких символів кілька, поверни їх у масиві.

// function func(str) {
//   if (typeof str !== "string") {
//     return false;
//   }

//   let obj = {};
//   let maxCount = 0;
//   let result = [];

//   for (let i = 0; i < str.length; i++) {
//     obj[str[i]] = (obj[str[i]] || 0) + 1;
//   }

//   for (let key in obj) {
//     if (obj[key] > maxCount) {
//         maxCount = obj[key]
//     }
//   }

//   for (let key in obj) {
//     if (obj[key] === maxCount) {
//         result.push(key)
//     }
//   }

//   return result;
// }

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Напиши функцию, которая принимает строку и возвращает строку, состоящую из уникальных символов (каждый символ появляется в строке только один раз).
