// Напиши функцію, яка приймає масив чисел і повертає новий масив, у якому всі числа помножені на 2.

// function func(arr) {
//     if (!Array.isArray(arr)) {
//         return false;
//     }

//     let newArr = [];

//     for (let i = 0; i < arr.length; i++) {
//         newArr.push(arr[i] * 2)
//     }

//     return newArr;
// }

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Подумай, які методи або цикли можуть допомогти перебрати масив і перевірити, чи є число парним.

// function func(arr) {
//     if (!Array.isArray(arr)) {
//         return false;
//     }

//     let sum = 0;

//     for (let i = 0; i < arr.length; i++) {
//         if (arr[i] % 2 === 0) {
//             sum += arr[i]
//         }
//     }

//     return sum;
// }

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Напиши функцию, которая возвращает массив всех чисел, которые встречаются в массиве больше одного раза.

// function func(arr) {
//     if (!Array.isArray(arr)) {
//         return false;
//     }

//     let newArr = [];
//     let count = {};

//     for (let i = 0; i < arr.length; i++) {
//         count[arr[i]] = (count[arr[i]] || 0) + 1
//     }

//     for (const key in count) {
//         if (count[key] > 1) {
//             newArr.push(Number(key))
//         }
//     }

//     return newArr;
// }