// Напиши функцію, яка приймає масив чисел і повертає новий масив, у якому всі числа помножені на 2.

// function func(arr) {
//     if (!Array.isArray(arr)) {
//         return false;
//     }

//     let newArr = [];

//     for (let i = 0; i < arr.length; i++) {
//         newArr.push(arr[i] * 2)
//     }

//     return newArr;
// }

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Подумай, які методи або цикли можуть допомогти перебрати масив і перевірити, чи є число парним.

// function func(arr) {
//     if (!Array.isArray(arr)) {
//         return false;
//     }

//     let sum = 0;

//     for (let i = 0; i < arr.length; i++) {
//         if (arr[i] % 2 === 0) {
//             sum += arr[i]
//         }
//     }

//     return sum;
// }

// console.log(func(3))

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Напиши функцию, которая возвращает массив всех чисел, которые встречаются в массиве больше одного раза.

// function func(arr) {
//     if (!Array.isArray(arr)) {
//         return false;
//     }

//     let newArr = [];
//     let count = {};

//     for (let i = 0; i < arr.length; i++) {
//         count[arr[i]] = (count[arr[i]] || 0) + 1
//     }

//     for (const key in count) {
//         if (count[key] > 1) {
//             newArr.push(Number(key))
//         }
//     }

//     return newArr;
// }

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Порахувати суму всіх чисел у масиві.

// const arr = [10, 10, 10, 14];

// function func(arr) {
//     if (!Array.isArray(arr)) {
//         return false
//     }

//     let sum = 0;

//     arr.forEach(element => {
//         sum += element;
//     });

//     return sum;
// }

// console.log(func(arr))

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Знайти максимальне та мінімальне значення у масиві.

// const arr = [10, 55, 1, 44];

// function func(arr) {
//     if (!Array.isArray(arr)) {
//         return false
//     }   
    
//     let maxEl = arr[0];
//     let minEl = arr[0];

//     arr.forEach(element => {
//         if (element > maxEl) {
//             maxEl = element
//         } else if(element < minEl) {
//             minEl = element;
//         }
//     });

//     return [minEl, maxEl];
// }

// console.log(func(arr))

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Перевірити, чи всі елементи масиву унікальні.

// const arr = [10, 11, 55, 1, 1, 44, 11, 12];

// function func(arr) {
//     let obj = {};
//     let result = [];

//     for (let i = 0; i < arr.length; i++) {
//         obj[arr[i]] = (obj[arr[i]] || 0) + 1;
//     }

//     for (let key in obj) {
//         if (obj[key] === 1) {
//             result.push(Number(key))
//         }
//     }

//     return result;
// }

// console.log(func(arr))

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

