// Напиши функцию, которая перебирает все ключи объекта и возвращает массив всех значений этого объекта.

// function myValues(obj) {
//     let result = [];

//     for (let key in obj) {
//         result.push(obj[key])
//     }

//     return result;
// }

// const obj = { a: 1, b: 2, c: 3 };
// console.log(myValues(obj));  // [1, 2, 3]

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Напиши функцию, которая будет получать объект и возвращать массив его ключей, используя метод Object.keys.

// function myKeys(obj) {
//     let result = [];

//     for (let key in obj) {
//         result.push(key)
//     }

//     return result;
// }

// const obj = { a: 1, b: 2, c: 3 };
// console.log(myKeys(obj));  // ['a', 'b', 'c']

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Напиши функцию, которая будет получать объект и возвращать массив его пар "ключ-значение" в виде подмассивов, используя метод Object.entries.

// function myEntries(obj) {
//     let result = [];

//     for (let key in obj) {
//         result.push([key, obj[key]])
//     }
//     return result
// }

// const obj = { a: 1, b: 2, c: 3 };
// console.log(myEntries(obj));  // [['a', 1], ['b', 2], ['c', 3]] 

// ________________________________________________________________________________________________________________________________________________________________________________________________________________

// Напиши функцию myAssign(target, ...sources), которая копирует все перечисляемые собственные свойства из одного или нескольких исходных объектов в целевой объект (target). 
// Она должна возвращать этот целевой объект.

function myAssign(target, ...sources) {
    for (let source of sources) {
        for (let key in source) {
            if (source.hasOwnProperty(key)) target[key] = source[key]
        }
    }

    return target;
}

const obj1 = { a: 1, b: 2 };
const obj2 = { b: 3, c: 4 };
const obj3 = { d: 5 };

const result = myAssign(obj1, obj2, obj3);

console.log(result); // { a: 1, b: 3, c: 4, d: 5 }